#include "Sys.h"

u8 SMG_Buff[8] = {
	0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF
};

u8 code SMG[] = {
	              0xC0,  //"0"
                0xF9,  //"1"
                0xA4,  //"2"
                0xB0,  //"3"
                0x99,  //"4"
                0x92,  //"5"
                0x82,  //"6"
                0xF8,  //"7"
                0x80,  //"8"
                0x90,  //"9"
                0x88,  //"A"
                0x83,  //"B"
                0xC6,  //"C"
                0xA1,  //"D"
                0x86,  //"E"
                0x8E,  //"F"
                0x89,  //"H"
                0xC7,  //"L"
                0xC8,  //"n"
                0xC1,  //"u"
                0x8C,  //"P"
                0xA3,  //"o"
                0xBF,  //"-"
                0xFF,  //熄灭
								0xFF  //自定义
};
/**************************************************************************
函数功能：数码管动态刷新
入口参数：无
返回值  ：无
**************************************************************************/
void SMG_Display()
{
	static u8 index = 0;
	

	P2 = (P2&0x1F) | 0xE0;  // 0001 1111 1110 0000 
	P0 = 0xFF;
	P2 = P2&0x1F;
	_nop_();
	
	P2 = (P2&0x1F) | 0xC0;
	P0 = 0x01<<index;	// 0000 0001
	P2 = P2&0x1F;
	
	_nop_();
	P2 = (P2&0x1F) | 0xE0;
	P0 = SMG_Buff[index];
	P2 = P2&0x1F;
	_nop_();
	index++;

  index &= 0x07; 
}
/**************************************************************************
函数功能：清空数码管缓冲区
入口参数：无
返回值  ：无
**************************************************************************/
void Refresh()
{
	u8 index = 0;
	for(index = 0; index < 8; index ++) SMG_Buff[index] = 0xFF;
}